app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
           <td><%= book.body %></td>
           <td><%= link_to "#{book.favorites.count}コメント", book_path(book.id) %> </td>