app/views/books/show.html.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
            <div>
              <p>コメント件数：<%= @book.favorites.count %></p>
                <% @book.favorites.each do |favorite| %>