app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("comment", "user_id", "created_at", "updated_at", "book_id") VALUES (?, ?, ?, ?, ?)  [["comment", "aaaaa"], ["user_id", 6], ["created_at", "2021-10-30 06:37:33.592688"], ["updated_at", "2021-10-30 06:37:33.592688"], ["book_id", 1]]
---
  def create
    book = Book.find(params[:book_id])
    comment = current_user.favorites.new(favorite_params)
    comment.book_id = book.id
    comment.save

DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
  Favorite.find_by(id:params[:id]).destroy