app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @user = current_user
    @book_new = Book.new
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book_new = Book.new
    @user = User.find(params[:id])