app/models/user.rb

  def follow(user_id)
    relationships.create(followed_id: user_id)
---
INSERT INTO "relationships" ("created_at", "updated_at", "follower_id", "followed_id") VALUES (?, ?, ?, ?)  [["created_at", "2021-11-02 04:27:30.958518"], ["updated_at", "2021-11-02 04:27:30.958518"], ["follower_id", 4], ["followed_id", 1]]